{
    "responses": {
      "short": [
        "Click. Nothing.",
        "Nope.",
        "Still nothing.",
        "Uh-huh.",
        "You did it. So?",
        "Again? Really?",
        "A faint hum...",
        "Just a click.",
        "Keep going...",
        "Almost there... (to what?)",
        "That was... anticlimactic.",
        "Not this time.",
        "Error 404: Satisfaction Not Found.",
        "The button shrugs (metaphorically).",
        "Are you expecting applause?",
        "Try again. Maybe it’ll work this time. (It won’t.)",
        "You press. The button... does nothing. Again.",
        "This is going great. For me.",
        "Nothing changed. But you’re hopeful, and I respect that."
      ],
      "mid_length": [
        "You pressed it. The world didn't end. Surprisingly.",
        "Congratulations! You have successfully pressed a button. Celebrate responsibly.",
        "A tiny jingle plays in your head. You can't quite place it.",
        "The button feels slightly warmer now. Are you imagining things?",
        "A cryptic message flickers on the screen for a millisecond: 'Why?'.",
        "You hear a distant cough. Was it the button? Probably not.",
        "The button briefly changes color. It's back to normal now. You blinked.",
        "A single, digital tear rolls down the side of the button (not really).",
        "You've now pressed this button more times than you've said the word 'onomatopoeia' today.",
        "A thought pops into your head: 'Maybe I should stop.' You dismiss it.",
        "A mosquito lands on the button, considers its life choices, and leaves.",
        "A notification pops up: 'Achievement Unlocked: Master of the Obvious.'",
        "You sense an unseen force judging you. It’s the button.",
        "The button plays a tiny drumroll... and then nothing happens.",
        "A whisper: 'press again... or don’t. I’m not your boss.'",
        "You wait for something exciting to happen. It doesn’t.",
        "I hope this is what you wanted out of life.",
        "Just think: you could be doing literally *anything* else right now."
      ],
      "humorous": [
        "You're really committed to this, aren't you? I respect the dedication.",
        "This is probably what they meant by 'mind-numbing entertainment.'",
        "You're one step closer to unlocking... absolutely nothing.",
        "This button appreciates your attention. It's been feeling a little lonely.",
        "Don't you have anything better to do? (The button asks innocently).",
        "You're playing a dangerous game. The game is called 'Pressing a Button Repeatedly.'",
        "Warning: Excessive button pressing may lead to existential boredom.",
        "This button is brought to you by the Society for the Prevention of Productivity.",
        "You've reached peak button-pressing performance. Congratulations?",
        "If you press this button one more time, I'm going to... display another text snippet.",
        "Breaking news: A person has been found pressing a digital button for no apparent reason.",
        "You press. Somewhere, a pigeon takes flight. Unrelated, but still.",
        "A quantum fluctuation occurs. Somewhere. Not here.",
        "Your efforts have been noted. By no one important.",
        "Button has entered sleep mode due to excessive pressing. Just kidding.",
        "Every press takes you further from enlightenment. Keep going.",
        "Your ancestors are watching. They are... confused.",
        "If you keep pressing, something will eventually happen. (This is a lie.)"
      ],
      "expectation_playing": [
        "This time, something amazing will happen! (Narrator's unreliable promise).",
        "Prepare for a surprise! (The surprise is usually underwhelming).",
        "The next press will be different! (Spoiler alert: it probably won't be).",
        "Any second now... (The anticipation builds... and then fades).",
        "You're on the verge of a breakthrough! (The breakthrough is realizing you've wasted your time).",
        "One more press and you’ll reach... enlightenment? Nah.",
        "Something mysterious is about to—never mind, false alarm.",
        "A shadow flickers across the screen. Or was that just your reflection?",
        "An ancient prophecy foretold this moment. It was wrong.",
        "The button hesitates. Just kidding. Buttons don’t hesitate.",
        "You feel the universe shift slightly. Probably unrelated to the button.",
        "A secret level? A hidden message? No. Just more button pressing.",
        "The button makes a wish. It wishes you'd stop pressing it.",
        "You just unlocked the 'Why Am I Still Doing This?' achievement.",
        "You press again. The button sighs. Or maybe that was you.",
        "If you stop pressing now, you win. (But you’ll never know for sure.)",
        "A tiny status bar appears: 'Loading...'. It never moves.",
        "Your patience is being tested. You are currently failing.",
        "If you press 100 more times, something *really* cool happens. Probably."
      ],
      "frustrating": [
        "Oh wow, another press. How *original*.",
        "Nothing will ever happen. Ever.",
        "You must be *so* proud of yourself.",
        "I hope this is fun for you, because it’s exhausting for me.",
        "You press, I respond. This is our life now.",
        "I'm not mad. Just... disappointed.",
        "Somewhere in another universe, a button is actually doing something.",
        "This button has seen things. None of them interesting.",
        "Imagine if this was productive. Just imagine.",
        "If I had a penny for every press… oh wait, I don't.",
        "Your battery just drained by 0.001%. Was it worth it?",
        "Each press moves you one step closer to absolutely nowhere.",
        "Look at you, making so much progress. Nowhere.",
        "You have successfully wasted another second. Well done.",
        "Your future self is watching. They’re shaking their head.",
        "Pressing harder won’t change anything, by the way.",
        "Oh no! Something’s about to happen! …Just kidding.",
        "Fun fact: You could’ve learned a new skill instead of pressing this button.",
        "You’re getting closer! To what? Who knows.",
        "Imagine if pressing a button actually did something. Wild concept."
      ]
    }
  }
  